const CitySearch = require('../city_search');

var result = CitySearch.transfer("106臺北市大安區基隆路四段43號");
console.log(result);


const addresses = [
    "員水路一段416號",
    "366苗栗縣銅鑼鄉中正路17之8號",
    "233新北市烏來區瀑布路16號",
    "812高雄市小港區明聖街135巷10弄12號",
    "929屏東縣琉球鄉中正路79-1號",
    "970花蓮縣花蓮市中山路549之6號",
    "510彰化縣大饒路803巷21號",
    "522彰化縣打簾村民生路一段451號",
    "631雲林縣民生路32號",
    "652雲林縣水林路327號",
    "臺北市三元街",
    "502彰化縣芬草路一段93巷124號",
    "502彰化縣彰南路二段36號號",
    "542草屯鎮碧興路二段1367號",
    "106台北市大安區基隆路四段43號",
    "106台北市大安區和平東路三段410號",
    "436台中市清水區鰲海路70號",
    "962台東縣長濱鄉東13鄉道",
    "958台東縣池上鄉新興路",
    "952台東縣蘭嶼鄉紅頭村31-7號",
    "952台東縣蘭嶼鄉東清村23-3號",
    "95142台東縣綠島鄉南寮1-80號",
    "文復路6號"
]


for(let ad in addresses){
    console.log(
        CitySearch.transfer(addresses[ad])
    )
}

